[{
    "image": "./img_resp/sponsor/Adon",
    "description": "Adon is a male dog rescued from dog meat traders in July 2006. We think Adon is about 10 years old and when he was rescued he had a severe wound around his snout, which has left quite a scar! Adon is a little guarded in his nature, probably a result of his treatment at the hands of the dog meat traders, and he does not approach new people immediately, but once you gain his trust he is a very loving dog who loves to lick!",
    "name": "Adon"
  },

  {
    "image": "./img_resp/sponsor/Adriana",
    "description": "Adriana is a female dog rescued from a Goat Garm in Laguna in June 2014. Adriana is about 4 years old and when we rescued her she was quite heavily pregnant and in July she gave birth to 3 gorgeous puppies, Cody, Bobby & Toby who are all doing well!",
    "name": "Adriana"
  },

  {
    "image": "./img_resp/sponsor/Alison",
    "description": "Alison is lovely female dog rescued from dog meat traders in La Union in August 2006. She is now believed to be 13 years old and although healthy and ready for adoption has not yet found the perfect new home!",
    "name": "Alison"
  },

  {
    "image": "./img_resp/sponsor/Anora",
    "description": "Anora is a female brindle dog rescued from dog meat traders in San Pedro, Laguna in February 2012. Anora is about 7 years old and still bears the scar of where the traders bound her nose with a tight plastic muzzle!",
    "name": "Anora"
  },

  {
    "image": "./img_resp/sponsor/April",
    "description": "April is a female dog rescued in General Trias, Cavite in April 2012. April is approximately 6 years old and was named after the month we rescued her! April is a very alert dog, always eager to play with whoever goes into her kennel and she is very maternal towards the other younger dogs.",
    "name": "April"
  },

  {
    "image": "./img_resp/sponsor/Beverly",
    "description": "Beverly is a female dog rescued from dog meat traders in Rosario, La Union in December 2006. Beverly came to us as a puppy and is now 8 years old and still hopeful of a new home.",
    "name": "Beverly"
  }, {
    "image": "./img_resp/sponsor/Blade",
    "description": "Blade is a male dog rescued from a Goat farm in Laguna in June 2014. Blade is approximately 3 years old and when he arrived at the Centre he was very afraid of men, unsurprisingly given the horrors that he had faced at the hands of the dog meat traders! Our rehabilitation staff are working hard with Blade to overcome these fears and they are hopeful of a great future for him. ",
    "name": "Blade"
  },

  {
    "image": "./img_resp/sponsor/Bobby",
    "description": "Bobby is one of 3 puppies born at the Centre in July 2014, his mother is Adriana. Adriana was rescued, heavily pregnant, from a Goat Farm in June and gave birth shortly after arriving with us. Bobby and his 2 brothers are doing well. ",
    "name": "Bobby"
  },

  {
    "image": "./img_resp/sponsor/Caesar",
    "description": "Caesar is a male dog who was rescued from a Goat farm in Laguna in June 2014, along with 10 other dogs all facing an horrific fate at the hands of dog meat traders. Caesar is about 4 years old and he was horribly thin and emaciated when he arrived at the Centre. Since then he's recovered, gaining  weight and is doing really well. ",
    "name": "Caesar"
  },

  {
    "image": "./img_resp/sponsor/Carissa",
    "description": "Carissa is a female dog rescued from dog meat traders in San Pedro, Laguna in October 2011. Carissa is approximately 5 years old.",
    "name": "Carissa"
  },

  {
    "image": "./img_resp/sponsor/Carmel",
    "description": "Carmel is a female dog rescued from dog meat traders as a young dog in San Pedro, Laguna in October 2011. Carmel is now a healthy and happy 4 year old hoping to find a new home soon.",
    "name": "Carmel"
  },

  {
    "image": "./img_resp/sponsor/Cliona",
    "description": "Cliona was one of 3 dogs rescued from a makeshift slaughterhouse being used by dog meat traders in Pangisinan in July 2014. During the rescue our investigators realised that Cliona was very heavily pregnant and so actually had to whelp her there and then. She gave birth to 3 puppies but sadly they did not survive, but Cliona is back and the Centre, having undergone rehabilitation and is doing really well despite the horrors of her ordeal. ",
    "name": "Cliona"
  },

  {
    "image": "./img_resp/sponsor/Cody",
    "description": "Cody is one of 3 puppies born at the Centre in July 2014, his mother is Adriana. Adriana was rescued, heavily pregnant, from a Goat Farm in June and gave birth shortly after arriving with us. Cody and his 2 brothers are doing well. ",
    "name": "Cody"
  },

  {
    "image": "./img_resp/sponsor/Coleen",
    "description": "Coleen is a female dog rescued  from dog meat traders in San Pedro, Laguna in OCtober 2011. We think Coleen is about 7 years old.",
    "name": "Coleen"
  },

  {
    "image": "./img_resp/sponsor/Daffy",
    "description": "Daffy is a female dog  who was rescued from a makeshift slaughter house being used by dog meat traders in Pangisinan in July 2014. When we found Daffy her legs were bound behind her back, so she was unable to move, and her snout was muzzled very tightly with plastic string, which when removed revealed quite a severe cut to her nose. When she arrived at the Centre Daffy was understandably  wary and quite aggressive but her wounds were treated and she began rehabilitation. The staff are specifically working on calming her and getting her to trust humans again and they are hopeful of a bright future. ",
    "name": "Daffy"
  },

  {
    "image": "./img_resp/sponsor/Dana",
    "description": "Dana is a female dog rescued from traders in Mabalacat, Pampanga in February 2007. We think Dana is now 9 years old.",
    "name": "Dana"
  },

  {
    "image": "./img_resp/sponsor/Dawn",
    "description": "Dawn is a female dog rescued from dog meat traders in Mabalacat, Pampanga in February 2007. When Dawn arrived with us she was very underweight and emaciated but she has thrived at the Centre and is now a 9 year old healthy dog hopeful to find a new home.",
    "name": "Dawn"
  },

  {
    "image": "./img_resp/sponsor/Den",
    "description": "Den is a male dog rescued from a Goat farm in Laguna in June 2014. We think Den is about 3 years old and when he arrived at the Centre he was suffering from Mange and was very thin and emaciated from a lack of nourishment at the hands of the dog meat traders. He's now been treated for the Mange and is gaining weight and doing well. ",
    "name": "Den"
  },

  {
    "image": "./img_resp/sponsor/Eliot",
    "description": "Eliot was one of three dogs that was rescued from a makeshift slaughterhouse being used by dog meat traders in Pangisinan in July 2014. We think Eliot is about 3 years old and he's proving to be a very friendly dog, despite all that he's been through. He has lots of energy and is a very playful chap who never stops wagging his tail!",
    "name": "Eliot"
  },

  {
    "image": "./img_resp/sponsor/Elsie",
    "description": "Elsie is a female dog rescued in Tuna, Benguet in March 2007; she was only a youngster when she came to us but she is now 8 years old. Elsie is very energetic and is always ready for a play, be it with other dogs or humans!",
    "name": "Elsie"
  },

  {
    "image": "./img_resp/sponsor/Farley",
    "description": "Farley is a male dog rescued from dog meat traders in Baguio City in December 2008; we think he is approximately 8 years old. Farley is an adorable dog, quiet but very loyal and once he knows you he wants to stay close!",
    "name": "Farley"
  },

  {
    "image": "./img_resp/sponsor/Floyd",
    "description": "Floyd is a male dog rescued from dog meat traders in Baguio City in December 2008. Floyd is about 8 years old now and is a happy and healthy dog who would love to find a new home.",
    "name": "Floyd"
  },

  {
    "image": "./img_resp/sponsor/Gloria",
    "description": "Gloria is a female dog rescued from dog meat traders in Candon, Ilocos Sur in July 2007. Rita was a youngster when she came to us but she's now a happy and healthy 8 year old who would love to find a new home.",
    "name": "Gloria"
  },

  {
    "image": "./img_resp/sponsor/Glynis",
    "description": "Glynis is a female dog rescued in Candon, Ilocos Sur in July 2007 and we think she is now about 10 years old. Glynis is one of old timers, she's a very quiet dog but she's always wagging her tail and loves a little bit of attention.",
    "name": "Glynis"
  },

  {
    "image": "./img_resp/sponsor/Jacob",
    "description": "Jacob is a male dog rescued from dog meat traders in Cubcub, Capas in July 2010. When we found Jacob he was very weak, emaciated and inactive, he has made a great recovery and we are hopeful of finding him a new home soon.",
    "name": "Jacob"
  },

  {
    "image": "./img_resp/sponsor/Julie",
    "description": "Julie is a female dog rescued from dog meat traders in Baguio City in December 2008; we think she is approximately 8 years old. Julie is a very loving dog, she never stops craving attention and she will never leave your side once you so much as stroke her!",
    "name": "Julie"
  },

  {
    "image": "./img_resp/sponsor/Lars",
    "description": "Lars is a male dog rescued from dog meat traders in Sta. Rosa, Laguna in March  2014. Lars is 3 years old and is a very playful and bubbly young dog, always wanting to play with the other dogs, who can't ever seem to match his energy!",
    "name": "Lars"
  },

  {
    "image": "./img_resp/sponsor/Leanne",
    "description": "Leanne is a female dog who is approximately 5 years old.",
    "name": "Leanne"
  },

  {
    "image": "./img_resp/sponsor/Leslie",
    "description": "Leslie is a female dog rescued from dog meat traders in Bacolod City in August 2009. Leslie is approximately 9 years old.",
    "name": "Leslie"
  },

  {
    "image": "./img_resp/sponsor/Liz",
    "description": "Liz is a female dog rescued from dog meat traders in Taguytay City in October 2012. She is approximately 4 years old and had a bad wound around her snout caused by the plastic string used to her muzzle her. Although Liz is quite a quiet dog who enjoys being on her own, she is always eager to please and she has a calm and reassuring presence. ",
    "name": "Liz"
  },

  {
    "image": "./img_resp/sponsor/Lloyd",
    "description": "Lloyd is a male dog, rescued from dog meat traders in Laguna in March 2011. He is approximately 9 years old and is a quiet but very loving dog, he always gives you an affectionate nudge when you enter his kennel and he enjoys a play with the other dogs.",
    "name": "Lloyd"
  },

  {
    "image": "./img_resp/sponsor/Lucy",
    "description": "Lucy is a female dog rescued from dog meat traders in Montalban in September 2009. We think she is about 6 years old and although she is rather a quiet dog she is very playful and never stops demanding attention from the kennel mates, she likes to be around people.",
    "name": "Lucy"
  },

  {
    "image": "./img_resp/sponsor/Marty",
    "description": "Marty is a male dog rescued in Padre Garcia, Cavite in April 2013. Marty is about 5 years old and has a scar on his nose where dog meat traders bound his muzzle with plastic string! Marty is very active and agile dog and he's always ready to play, darting in out of peoples legs and between other dogs, he's also a very loving dog.",
    "name": "Marty"
  },

  {
    "image": "./img_resp/sponsor/Mita",
    "description": "Mita is a female dog rescued from dog meat traders in San Carolos, Pangasinan in December 2011. Mita is approximately 4 years old with a lovely nature and we are hopeful that she can find a new owner soon.",
    "name": "Mita"
  },

  {
    "image": "./img_resp/sponsor/Petal",
    "description": "Petal is a female dog rescued from dog meat traders in Manila in December 2010.  Petal is now about 6 years old.",
    "name": "Petal"
  },

  {
    "image": "./img_resp/sponsor/Precy",
    "description": "Precy is a female dog rescued from dog meat traders in Alfonso, Cavite in October 2012. Precy is approximately 6 years old.",
    "name": "Precy"
  },

  {
    "image": "./img_resp/sponsor/Rita",
    "description": "Rita is a female dog who was handed over to us by the PSPCA in Manila in December 2010. We estimate Rita to be about 8 years old and when she came to us Rita was suffering from Canine Distemper, which many dogs don't survive so that makes her even more special to us! Rita is a very active dog with a loving and playful nature.",
    "name": "Rita"
  },

  {
    "image": "./img_resp/sponsor/Roxy",
    "description": "Roxy is a female dog rescued from dog meat traders in Manila in December 2010. Roxy is a brindle dog who we think is about 7 years old. She's quite a protective dogs with a big bark, which she uses quite often but she loves to play with other dogs and her tail never stops wagging!",
    "name": "Roxy"
  },

  {
    "image": "./img_resp/sponsor/Sharon",
    "description": "Sharon is a female dog rescued from dog meat traders in Laguna in March 2011. Sharon is approximately 5 years old and is quite a private dog who enjoys her own company, she also loves the dirt!",
    "name": "Sharon"
  },

  {
    "image": "./img_resp/sponsor/Shine",
    "description": "Shine is a female dog rescued from dog meat traders in Alfonso, Cavite in October 2012. Shine is approximately 4 years old and she is a very agile dog who loves climbing and jumping; she's also a very gentle dog who enjoys watching other dogs at play in the kennel.",
    "name": "Shine"
  },

  {
    "image": "./img_resp/sponsor/Toby",
    "description": "Toby was one of 3 puppies born at the Centre in July 2014, his mother is Adriana. Adriana was rescued, heavily pregnant, from a Goat Farm in June and gave birth shortly after arriving with us. Toby and his 2 brothers are doing well. ",
    "name": "Toby"
  }
]
