[{
    "tag": "commons",
    "image": "./img_resp/150128WST-189",
    "title_caption": "<span class=\"copy\">Image &copy; Philip Durrant</span>",
    "title": "Dame Judi Dench and Peter Egan lend their support!",
    "date": "January 2015",
    "text": "<div class=\"row\"><p>Wednesday 28th January was a landmark day in the history of ending the dog meat trade, as IWCT and members of the Asian Canine Protection Alliance met with politicians at the House of Commons to discuss the dog meat trade in Southeast Asia and ways in which British government can help bring it to an end!</p><figure class=\"col-md-6 img-responsive img-flow\"><img src=\"img_resp/150128WST-89-medium.jpg\" srcset=\"img_resp/150128WST-89-small.jpg 320w, img_resp/150128WST-89-medium.jpg 640w, img_resp/150128WST-89-large.jpg 1024w\"><figcaption>David Mills, IWCT Trustee & Dame Judi Dench<br><span class=\"copy\">Image &copy; Philip Durrant</span></figcaption></figure><p>Our new patron, the animal welfare advocate Peter Egan, spoke along with John Hawkridge, the chairman of IWCT trustees, and gave the audience of 25 MPs and representatives of other animal welfare groups an insight into the horrors of the dog meat trade and the brutality that the dogs face in the hands of the evil traders. We were also very fortunate to have Dame Judi Dench in the audience, helping raise awareness of this horrific practice. We are thrilled that Judi has also just agreed to become a patron of IWCT.</p><p>The session was an MP's briefing led by John McDonnell MP who, having become aware of the dog meat trade, supported an early day motion in parliament last year, calling for an immediate end to the dog meat trade, which has so far received a phenomenal 136  signatures, a great sign that MP's are willing to help!</p> </div><div class=\"row\"><figure class=\"col-md-6 img-responsive img-flow pull-left\"><img src=\"img_resp/150128WST-133-medium.jpg\" srcset=\"img_resp/150128WST-133-small.jpg 320w, img_resp/150128WST-133-medium.jpg 640w, img_resp/150128WST-133-large.jpg 1024w\"><figcaption>John Hawkridge, IWCT Trustee, Peter Egan, John McDonnell MP & Tobias Ellwood MP<br><span class=\"copy\">Image &copy; Philip Durrant</span></figcaption></figure><p>The audience was also shown two short films about the trade, which provided harrowing but moving viewing and included the Soi Dog film \"I didn't know\" featuring Ricky Gervais, Peter Egan,  Judi Dench and stars of Downtown Abbey! It was apparent that although many have heard about the trade, most are not aware of the atrocious cruelty that goes with it, but the fact that in most of these countries, it is only a handful of people that are involved gives hope that with our help it could be brought to an end!</p></div><div class=\"row\"><p>The session ended with a poignant question to the MP's, a question posed by Lola Webber, from Change for Animals Foundation: 'Who is going to get this evil trade banned? If no you, then who? If not now, then when?</p></div><figure><img src=\"img_resp/150128WST-240-medium.jpg\" srcset=\"img_resp/150128WST-240-small.jpg 320w, img_resp/150128WST-240-medium.jpg 640w, img_resp/150128WST-240-large.jpg 1024w\"><figcaption><span class=\"copy\">Image &copy; Philip Durrant</span></figcaption></figure>"
}, {
    "tag": "city_dogs",
    "image": "./img_resp/news/Anna_Abbey_&_Andrea",
    "title_caption": "",
    "title": "TAKING ON THE CITY DOG POUNDS",
    "date": "December 2014",
    "text": "<p>We'd like to introduce you to Anna, Abbey & Andrea, 3 dogs that have recently come to us from a city dog pound in Manila.</p><p>The law in the Philippines prevents you from allowing your dog out without  leash and so any dogs found roaming, of which there continue to be many, are rounded up by government employed dog catchers, who take them to the city dog pounds. In general these pounds leave a lot to be desired, they are often overcrowded, dirty and what food the dogs are given is of very poor quality. Most importantly if a dog is not claimed within 7 days of arriving at the pound it is put to sleep.</p><p>As a result we are determined to take these pounds on and we've started by visiting a dog pound in Manila, who have agreed, with our help, to make some much needed improvements, which began with us supplying them with some decent dog food and new food & water bowls. On our second visit we agreed to take 11 of the pound dogs back to our Rescue Centre, where they received necessary veterinary and vaccination treatment and were neutered. Those 11 dogs, all of whom we have given names beginning with A, are now receiving rehabilitation and socialisation treatment to prepare them for re-homing.</p><div class=row><div class=\"col-md-6\"><figure> <img src=img_resp/news/Alex_Anthony_&_Andrew-medium.jpg srcset=\"img_resp/news/Alex_Anthony_&_Andrew-small.jpg 320w, img_resp/news/Alex_Anthony_&_Andrew-medium.jpg 640w, img_resp/news/Alex_Anthony_&_Andrew-large.jpg 1024w\"></figure></div><div class=\"col-md-6\"><figure><img src=img_resp/news/Abbey_with_Pups-medium.jpg srcset=\"img_resp/news/Abbey_with_Pups-small.jpg 320w, img_resp/news/Abbey_with_Pups-medium.jpg 640w, img_resp/news/Abbey_with_Pups-large.jpg 1024w\"></figure></div></div><p>Once they are fit and well an AKF veterinary team will return to the dog pound in Manila to hold an Adoption Day, when people can bring in their cat or dog and we will provide free vaccination and neutering. It will also provide the opportunity for the 11 rehabilitated dogs to meet prospective new owners with the ultimate goal of finding them a new home. All being well and if funds allow, we are hoping to extend this to more pounds in the coming year.</p>"
}, {
    "tag": "craig",
    "image": "./img_resp/news/Craig",
    "title_caption": "",
    "title": "REMEMBER CRAIG?",
    "date": "November 2014",
    "text": "<div class=\"row\"><div class=\"col-md-4\"><figure><img src=img_resp/news/Craig_caged-medium.jpg srcset=\"img_resp/news/Craig_caged-small.jpg 320w, img_resp/news/Craig_caged-medium.jpg 640w, img_resp/news/Craig_caged-large.jpg 1024w\"></figure></div><div class=\"col-md-8\"><p>During a raid back in June 2014, we found Craig trapped in a cage cowering in fear, awaiting a horrible fate at the hands of illegal dog meat traders. Fortunately he was one of 11 dogs that we rescued and brought back to the AKF Rescue Centre, where he received veterinary treatment and neutering and over the last few months has been rehabilitating and socialising in preparation for re-homing.</p></div></div><div class=\"row\"><div class=\"col-md-8\"><p>Once he arrived at the Centre Craig lowered his guard and it quickly became clear that he is a very caring and happy dog who rarely stops wagging his tail! We are so delighted to be able to tell you that last week we held an Adoption Day in Tarlac and Craig has found a new owner, who fell in love with the tail-wagging dog at first sight! So Craig has gone from a frightened dog facing a horrible execution to a happy dog with a loving new home.</p><p>A happy tale from a survivor of the dog meat trade.</p></div><div class=\"col-md-4\"><figure><img src=img_resp/news/Craig_adopted-medium.jpg style=\"height:500px\" srcset=\"img_resp/news/Craig_adopted-small.jpg 320w, img_resp/news/Craig_adopted-medium.jpg 640w, img_resp/news/Craig_adopted-large.jpg 1024w\"></figure></div></div>"
}, {
    "tag": "adina",
    "image": "./img_resp/news/Adina_and_Amara",
    "title_caption": "",
    "title": "TWO SURVIVORS OF THE DOG MEAT TRADE ARE ADOPTED",
    "date": "October 2014",
    "text": "<p>Adina and Amara were two of the dogs rescued from a goat farm in Laguna back on 23rd June this year.</p><p>They were part of a group of dogs found on the farm which was believed to be slaughtering dogs and then mixing the dog meat with goat meat and selling it on to restaurants.</p><p>Sadly 3 dead dogs were also found at the scene, one already slaughtered and two puppies recently born to one of the dogs but who’d been left to die by the farmer. The surviving 11 dogs were taken back to the Rescue Centre in Capas where they all received treatment and food, most of them were emaciated and very underweight. All then underwent the minimum period of 2 months of rehabilitation during which they were neutered and they all gained weight.</p><p>Both Amara and Adina settled in really well and really enjoyed playing with the other dogs at the Centre and Amara showed a particular love of going for long walks. Like the majority of the dogs at the Centre, once they have been rehabilitated and socialised, they are ready for adoption and we are thrilled to tell you that both Adina and Amara have been successfully adopted, both to families living near to the Centre.</p><p>Adina has gone to live with a family who currently have 1 dog and 2 cats and Amara has gone to a family whose children were desperate for a pet so she has fulfilled their wish. We look forward to hearing how they get on in their loving new homes, having survived the horrors of the illegal dog meat trade in the Philippines.</p>"
}, {
    "tag": "cliona",
    "image": "./img_resp/news/Cliona_Caged",
    "title_caption": "",
    "title": "TIME OF MAN EATING ITS BEST FRIEND TO END",
    "date": "July 2014",
    "text": "<p><strong>The time of man eating its best friend could end as Philippines looks for a complete ban!</strong></p> <p>After criticism of its apparent inaction towards the dog meat trade, despite the fact that the slaughter of dogs for human consumption is illegal in the Philippines, it has been announced that the Bureau of Animal Industries is spearheading a national plan of action toward a dog meat trade free Philippines!</p> <p>This was announced at a forum in Baguio in the Philippines in early July, an offshoot of last year’s celebration of World Animal Day and was attended by government officials, Police and Social Welfare representatives and of course our very own Charles Wartenberg CEO of IWCT & AKF. The campaign is consistent with the country’s commitment to improving animal welfare practices in farming and livestock and crucially, aside from the obvious horrific cruelty suffered by the dogs, the health and sanitation issues linked to the movement and slaughter of dogs were also raised.</p> <p>If the plan comes to fruition the Philippines would be the first country in South East Asia to denounce the trade! </p> <p>See also: <a href=\"http://president.gov.ph/news/campaign-trade-dogs-meat/\">Government announcement</a> <a href=\"http://www.abs-cbnnews.com/business/07/03/14/ph-moves-ban-trade-dog-meat\">ABC News</a></p>"
}, {
    "tag": "daffy",
    "image": "./img_resp/news/Daffy",
    "title_caption": "",
    "title": "DAFFY'S STORY SO FAR.....",
    "date": "September 2014",
    "text": "<div class=\"row\"><div class=\"col-md-4\"><figure><img src=img_resp/news/Daffy_Outside-medium.jpg srcset=\"img_resp/news/Daffy_Outside-small.jpg 320w, img_resp/news/Daffy_Outside-medium.jpg 640w, img_resp/news/Daffy_Outside-large.jpg 1024w\"></figure></div><div class=\"col-md-8\"><p>This is Daffy, a female Askal dog who was rescued in July from a house that appeared to be being used as a dog slaughterhouse as part of the illegal dog meat trade in the Philippines. When we found her she was bound by her feet and she had plastic string wrapped tightly around her muzzle, which caused a deep gash on her nose. She was taken back to the Rescue Centre in Capas, together with two other dogs, Cliona and Eliot, where they were treated by the veterinary staff and began rehabilitation.</p></div></div><p> Now you will see that Daffy has come on leaps and bounds, although unsurprisingly she is still a little nervous and aggressive. We think she's about 3 1/2 years old and she has just been spayed and we are hopeful that in the coming months she be ready for us to consider re-homing. The other 2 dogs rescued with Daffy, are a brindle we named Cliona and an excitable young chap named Eliot. You may remember that Cliona whelped during the rescue, sadly none of her three puppies were strong enough to survive, but she is doing well back at the Centre now, estimated to be about 4 years old, she was also treated for a wound on her snout, caused by the tight binding. Eliot, a very energetic and playful dog we think to be about 3 years old. We are hopeful about re-homing both of these dogs.</p><div class=\"row\"><div class=\"col-md-6\"><figure><img src=img_resp/news/Cliona-medium.jpg srcset=\"img_resp/news/Cliona-small.jpg 320w, img_resp/news/Cliona-medium.jpg 640w, img_resp/news/Cliona-large.jpg 1024w\"></figure></div><div class=\"col-md-6\"><figure><img src=img_resp/news/Eliot-medium.jpg srcset=\"img_resp/news/Eliot-small.jpg 320w, img_resp/news/Eliot-medium.jpg 640w, img_resp/news/Eliot-large.jpg 1024w\"></figure></div>"
}, {
    "tag": "adriana_pups",
    "image": "./img_resp/news/Adriana&Pups",
    "title_caption": "",
    "title": "ADRIANA'S HAD HER PUPPIES",
    "date": "August 2014",
    "text": "<p>Adriana was one of the dogs rescued from the Goat Meat Farm in Laguna in June 2014. It was soon apparent that she was expecting puppies and on 28th July she successfully gave birth to 3 male puppies who have been named Bobby, Cody and Toby. Mother and boys are all doing well.</p><div class=\"row\"><div class=\"col-md-6\"><figure><img src=img_resp/news/bobby-medium.jpg srcset=\"img_resp/news/bobby-small.jpg 320w, img_resp/news/bobby-medium.jpg 640w, img_resp/news/bobby-large.jpg 1024w\"></figure></div><div class=\"col-md-6\"><figure><img src=img_resp/news/cody-medium.jpg srcset=\"img_resp/news/cody-small.jpg 320w, img_resp/news/cody-medium.jpg 640w, img_resp/news/cody-large.jpg 1024w\"></figure></div>"
}, {
    "tag": "blade",
    "image": "./img_resp/news/Blade",
    "title_caption": "",
    "title": "INTRODUCING SOME SURVIVORS OF THE DOG MEAT TRADE",
    "date": "July 2014",
    "text": "<h4>MEET SOME OF THE OTHER DOGS RESCUED FROM LAGUNA</h4><div class=\"row\"><div class=\"col-md-6\"><h3>Amara</h3><p>Amara, a brown female Askal (Philippine mongrel) dog, we estimate her to be about 1 1/2 years old. She’s a sociable dog who loves going for walks and playing with other dogs.</p><h3>Adina</h3><p>Adina, a white female Askal who came to the Centre weighing just 9kg, she’s since put on weight, now weighing 11kg and we estimate her to be about 2 years old.</p></div><div class=\"col-md-6\"><figure><img src=img_resp/news/Adina_and_Amara-medium.jpg srcset=\"img_resp/news/Adina_and_Amara-small.jpg 320w, img_resp/news/Adina_and_Amara-medium.jpg 640w, img_resp/news/Adina_and_Amara-large.jpg 1024w\"></figure></div></div><div class=\"row\"><div class=\"col-md-6\"><h3>Corin</h3><p>Corin is a male dog, he was also very thin when he was rescued, but has gained 3kg since being at the Centre. He’s a very playful dog with lots of energy and a very loud bark!</p></div><div class=\"col-md-6\"><figure><img src=img_resp/news/Corin_Outside-medium.jpg srcset=\"img_resp/news/Corin_Outside-small.jpg 320w, img_resp/news/Corin_Outside-medium.jpg 640w, img_resp/news/Corin_Outside-large.jpg 1024w\"></figure></div></div><div class=\"row\"><div class=\"col-md-6\"><h3>Den</h3><p>Den is a male dog who was very emaciated when rescued and was suffering from Mange. He has now been treated for the Mange and is putting on weight, we think he’s about 3 years old.</p></div><div class=\"col-md-6\"><figure><img src=img_resp/news/Den-medium.jpg srcset=\"img_resp/news/Den-small.jpg 320w, img_resp/news/Den-medium.jpg 640w, img_resp/news/Den-large.jpg 1024w\"></figure></div></div><div class=\"row\"><div class=\"col-md-6\"><h3>Blade</h3><p>Blade is another male Askal dog who we estimate to be about 3 years old. We think Blade has been through some hard times as he has a fear of men, which is something that we are working on with him.</p></div><div class=\"col-md-6\"><figure><img src=img_resp/news/Blade_Outside-medium.jpg srcset=\"img_resp/news/Blade_Outside-small.jpg 320w, img_resp/news/Blade_Outside-medium.jpg 640w, img_resp/news/Blade_Outside-large.jpg 1024w\"></figure></div></div>"
}, {
    "tag": "trader_raid",
    "image": "./img_resp/news/Daffybound&muzzled",
    "title_caption": "",
    "title": "RAID ON DOG MEAT TRADERS HOUSE",
    "date": "July 2014",
    "text": "<div class=\"row\"><div class=\"col-md-6\"><p>On Tuesday 15th July a raid was carried out on a house, which appeared to be being used as a slaughterhouse. Upon entering the house 3 adult dogs were found, one female bound by the feet and nose. Once freed from her constraints, a wound to the dorsal part of the upper jaw was revealed, caused by plastic string wrapped tightly around her muzzle.</p><p>Another female dog was also found tied up with a chain. It was immediately apparent that she was heavily pregnant and it was quickly decided that she should be whelped there and then. 3 puppies were born, sadly only one survived but it wasn’t strong enough and died soon after arriving at the Centre. The owner of the house was not at home, but a warrant has been issued for his arrest.</p></div><div class=\"col-md-6\"><figure><img src=img_resp/news/Cliona_tied_up-medium.jpg srcset=\"img_resp/news/Cliona_tied_up-small.jpg 320w, img_resp/news/Cliona_tied_up-medium.jpg 640w, img_resp/news/Cliona_tied_up-large.jpg 1024w\"></figure></div></div>"
}, {
    "tag": "craig_now_then",
    "image": "./img_resp/news/Craig_then_and_now",
    "title_caption": "",
    "title": "CRAIG - NO LONG COWERING",
    "date": "July 2014",
    "text": "<h4>WHAT A DIFFERENCE A LITTLE LOVE CAN MAKE……</h4><p>Craig was one of the dogs we rescue from a goat farm in Laguna in June. We found Craig cowering in a cage, tail down and frightened of what lay ahead. AKF investigators, with the help of the Philippine National Police, raided the farm and took all the live dogs back to the AKF Rescue Centre in Capas. 3 weeks on and here Craig is, a rather different looking chap!</p><p>The vet estimated him to be about 4 years old and he’s been gaining weight ever since he arrived. He’s a very caring and loving dog, who’s tail doesn’t stop wagging, despite all that he's been through, so we’re hopeful that once he’s fully rehabilitated we will be able to find him a very happy home.</p>"
}, {
    "tag": "corin",
    "image": "./img_resp/news/Corin_on_arrival",
    "title_caption": "",
    "title": "DOGS RECOVER BACK AT THE CENTRE",
    "date": "June 2014",
    "text": "<div class=\"row\"><div class=\"col-md-6\"><p>This is one of the dogs that was rescued from the goat farm where he would have been slaughtered for meat! He’s been named Corin, an Askal dog (the Philippine mongrel) who our vet estimated to be about 2 years old. When he came in he weighed just 8kg, but after his first few days at the Centre he’s already gained 2kg and appears to be very playful.</p><p>And this is Adriana, a female dog rescued from the same place as Corin and who is expecting puppies at the end of July. She is thought to be about 4 years old and is now in a separate pen until she has her puppies.</p></div><div class=\"col-md-6\"><figure><img src=img_resp/news/Adriana-medium.jpg  srcset=\"img_resp/news/Adriana-small.jpg 320w, img_resp/news/Adriana-medium.jpg 640w, img_resp/news/Adriana-large.jpg 1024w\"></figure></div></div>"
}, {
    "tag": "laguna",
    "image": "./img_resp/news/akf-rescuing-dogs-2",
    "title_caption": "",
    "title": "RAID ON GOAT FARM IN LAGUNA - 11 DOGS RESCUED",
    "date": "June 2014",
    "text": "<div class=\"row\"><div class=\"col-md-6\"><p>At around 10.30pm on Monday 23rd June, Animal Kingdom Foundation (AKF) investigators, together with Philippine National Police (PNP) operatives carried out a raid on a goat farm in Laguna, a province situated south of Manila in the Philippines, following a tip-off from an informant that the farm was also slaughtering dogs.</p><p>Once inside the farm the PNP operatives discovered a small number of caged dogs, in appalling conditions, many on the brink of death, sadly they also found 3 dogs who were already dead. They discovered tools for capturing and killing dogs and it was later confirmed that the farm’s practice was to slaughter dogs alongside goats, mix up the meat of both animals and sell it on.</p></div><div class=\"col-md-6\"><figure><img src=img_resp/news/Craig_caged-medium.jpg srcset=\"img_resp/news/Craig_caged-small.jpg 320w, img_resp/news/Craig_caged-medium.jpg 640w, img_resp/news/Craig_caged-large.jpg 1024w\"></figure></div></div><div class=\"row\"><p>The owner of the farm turned out to be the village chief and he, together with his father and the farm’s caretaker have had 4 separate cases of animal welfare violations, consumer act, meat inspection bureau’s code violation and anti rabies act filed against them. AKF, working alongside PNP, have now taken the 11 surviving dogs to the Rescue Centre in Capas where they will spend a minimum of two months in the recovery pen. There they will receive full physical and social rehabilitation before being put into the re-homing scheme with the hope of adoption into new loving homes.</p></div><div class=\"row\"><div class=\"col-md-6\"><figure><img src=img_resp/news/Laguna_Dogs_arrival-medium.jpg srcset=\"img_resp/news/Laguna_Dogs_arrival-small.jpg 320w, img_resp/news/Laguna_Dogs_arrival-medium.jpg 640w, img_resp/news/Laguna_Dogs_arrival-large.jpg 1024w\"></figure></div><div class=\"col-md-6\"><figure><img src=img_resp/news/Laguna_Dogs_arrival_2-medium.jpg srcset=\"img_resp/news/Laguna_Dogs_arrival_2-small.jpg 320w, img_resp/news/Laguna_Dogs_arrival_2-medium.jpg 640w, img_resp/news/Laguna_Dogs_arrival_2-large.jpg 1024w\"></figure></div></div><div class=\"row\"><p>These are a few photos of the rescued dogs beginning their rehabilitation back at the Centre, look out for news of their recovery in the coming weeks!</p></div>"
}]
