[{
    "image": "./img_resp/tales/Craig",
    "description": " <p>We found Craig, thin and scared, cowering in a locked cage awaiting his fate at the hands of cruel dog meat traders.</p><p>He was brought back to the Rescue Centre and almost immediately began to wag his tail and he hasn't stopped wagging it since. He's a happy and caring dog, with an incredibly trusting nature, given what he's been through and it wasn't a surprise when a family chose him at one of our Adoption Days in November, apparently it was his wagging tail that they fell in love with!</p>",
    "name": "Craig's Story"
},

{
    "image": "./img_resp/tales/Eliot",
    "description": "<p>Eliot was rescued in the summer of 2014 from a makeshift slaughterhouse, along with 2 other dogs and all 3 dogs were either chained or bound by the muzzle.</p><p>When we rescued Eliot, he was only 9 1/2 kg, which was very underweight for a dog of his size. He soon put the weight on and turned out to be a very playful, active dogs, who loves his walks (and runs). Not surprisingly he was adopted at the end of last year and this playful young chap is now part of a new and loving family.</p>",
    "name": "Eliot's Story"
},

{
    "image": "./img_resp/tales/Spike",
    "description": "Spike was one of 60 dogs rescued in San Carlos in December 2012. All the dogs were heading north to be killed for the dinner table but thankfully we were able to intercept them and although very sadly 12 had already died, the rest were rescued and brought back to the Centre.  A year later a young man called Arvie came to an Adoption Day, which we held in Angeles City and he immediately fell in love with Spike. He was so intent on having Spike that he sent his cousin home to fetch his mother whilst he remained and guarded Spike to ensure that no-one else was able to adopt him. About an hour later his cousin returned with his mother and once the adoption process was complete Spike had found a new home with Arvie!",
    "name": "Spike's Story"
},

{
    "image": "./img_resp/tales/Manny",
    "description": "<p>Back in 2008 when dog-meat selling was openly done in the market of Baguio City, Manny was among a group of dogs rounded up by the local dog pound, in order to avoid being slaughtered for the dinner table.  We then claimed a number of these dogs and brought them back to the Rescue Centre.</p><p>When Manny arrived at the Centre he was emaciated and suffering from Phimosis, a reproductive organ disorder, but he was soon treated and fed and quickly became one of the centre's friendliest dogs. Whenever we have visitors Manny will join the group tour, get himself into every photograph and put everyone in a good mood with his entertaining spirit. After nearly 7 years with us, the Centre may always remain his home, but we know how happy he is surrounded by people and other dogs and he couldn't be more content.</p>",
    "name": "Manny's Story"
},

{
    "image": "./img_resp/tales/Troy",
    "description": "<p>Troy was among a large group of dogs that was discovered during a vehicle seizure in May 2012. When the truck was stopped and raided we found dogs 73 hidden below a false floor, many bound and muzzled and all headed for the slaughterhouse. Sadly some of the dogs had already died, starved of air and water in unbearable heat, unable to escape, but Troy was one who was one of lucky ones. He was brought back to the Centre and 18 months later we held an Adoption Day in Manila and at that event Troy met Maria and they formed an instant bond. Maria was overwhelmed when she learnt how Troy had got the heavy scar on his muzzle and she adopted him!</p>",
    "name": "Troy's Story"
}]